InformationRegisters/НастройкаПередачиПравИсполнителей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкаПередачиПравИсполнителей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтКого</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольИсполнителей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныйОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаПередачиПравИсполнителей/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	РольИсполнителейПредставление = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеИсполнителяЭтапа(
		Запись.РольИсполнителей,
		Запись.ОсновнойОбъектАдресации,
		Запись.ДополнительныйОбъектАдресации);
	
	Если Не ЗначениеЗаполнено(Запись.РольИсполнителей) Тогда
		СпособПередачи = "ОтПользователяКПользователю";
	ИначеЕсли Не ЗначениеЗаполнено(Запись.ОтКого) Тогда
		СпособПередачи = "ОтРолиКПользователю";
	Иначе
		СпособПередачи = "ОтПользователяКПользователюВРамкахРоли";
	КонецЕсли;
	
	ЗаполнитьСпискиВыбораПользователей(ЭтотОбъект);
	
	ПередаютсяПрава = НСтр("ru='- отмена выполнения задач
		|- отмена принятия к исполнению задач
		|- принятие к исполнению задач
		|- возврат задач на роль исполнителя'");
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если (СпособПередачи = "ОтРолиКПользователю"
			ИЛИ СпособПередачи = "ОтПользователяКПользователюВРамкахРоли")
		И НЕ ЗначениеЗаполнено(Запись.РольИсполнителей) Тогда
		ТекстСообщения = НСтр("ru='Поле ""Роль исполнителей"" не заполнено'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"РольИсполнителейПредставление",,Отказ);
	КонецЕсли;
	
	Если (СпособПередачи = "ОтПользователяКПользователю"
			ИЛИ СпособПередачи = "ОтПользователяКПользователюВРамкахРоли")
		И НЕ ЗначениеЗаполнено(Запись.ОтКого) Тогда
		ТекстСообщения = НСтр("ru='Поле ""От кого"" не заполнено'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"ОтКого","Запись",Отказ);
	КонецЕсли;
	
	Если Запись.Кому = Запись.ОтКого Тогда
		ТекстСообщения = НСтр("ru='Поля ""Кому"" и ""От кого"" должны быть заполнены разными пользователями!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ДатаОкончанияДействия)
		И Запись.ДатаОкончанияДействия < Запись.ДатаНачалаДействия Тогда
		ТекстСообщения = НСтр("ru='Дата окончания действия не может быть ранее даты начала действия!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"ДатаОкончанияДействия","Запись",Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ОсновнойОбъектАдресации) Тогда
		ТекущийОбъект.ОсновнойОбъектАдресации = Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущийОбъект.ДополнительныйОбъектАдресации) Тогда
		ТекущийОбъект.ДополнительныйОбъектАдресации = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РольИсполнителейНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПроцессыОбработкиДокументовКлиент.ВыбратьИсполнителя(Элемент, Запись.РольИсполнителей, Истина, Ложь, "Выбор роли исполнителей");
	
КонецПроцедуры

&НаКлиенте
Процедура РольИсполнителейОчистка(Элемент, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	
	Запись.РольИсполнителей = ПредопределенноеЗначение("Справочник.РолиИсполнителей.ПустаяСсылка");
	Запись.ОсновнойОбъектАдресации = Неопределено;
	Запись.ДополнительныйОбъектАдресации = Неопределено;
	
	Запись.ОтКого = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	Элементы.ОтКого.СписокВыбора.Очистить();
	
	Если СпособПередачи = "ОтПользователяКПользователюВРамкахРоли" Тогда
		Запись.Кому = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		Элементы.Кому.СписокВыбора.Очистить();
	КонецЕсли;
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РольИсполнителейОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, Запись.РольИсполнителей);
КонецПроцедуры

&НаКлиенте
Процедура РольИсполнителейОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Запись.РольИсполнителей = ВыбранноеЗначение.РольИсполнителя;
		Запись.ОсновнойОбъектАдресации = ВыбранноеЗначение.ОсновнойОбъектАдресации;
		Запись.ДополнительныйОбъектАдресации = ВыбранноеЗначение.ДополнительныйОбъектАдресации;
	Иначе
		Запись.РольИсполнителей = ВыбранноеЗначение;
		Запись.ОсновнойОбъектАдресации = Неопределено;
		Запись.ДополнительныйОбъектАдресации = Неопределено;
	КонецЕсли;
	
	ВыбранноеЗначение = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеИсполнителяЭтапа(
		Запись.РольИсполнителей, Запись.ОсновнойОбъектАдресации, Запись.ДополнительныйОбъектАдресации);
	
	ЗаполнитьСпискиВыбораПользователей(ЭтотОбъект);
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтКогоПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособПередачиПриИзменении(Элемент)
	
	Если СпособПередачи = "ОтПользователяКПользователю" Тогда
		Запись.РольИсполнителей = ПредопределенноеЗначение("Справочник.РолиИсполнителей.ПустаяСсылка");
		Запись.ОсновнойОбъектАдресации = Неопределено;
		Запись.ДополнительныйОбъектАдресации = Неопределено;
		РольИсполнителейПредставление = "";
	ИначеЕсли СпособПередачи = "ОтРолиКПользователю" Тогда
		Запись.ОтКого = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	КонецЕсли;
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСпискиВыбораПользователей(Форма)
	
	МассивИсполнителей = Новый Массив;
	
	Если Форма.СпособПередачи = "ОтПользователяКПользователюВРамкахРоли" Тогда
		МассивИсполнителей = ИсполнителиРоли(Форма.Запись.РольИсполнителей,
			Форма.Запись.ОсновнойОбъектАдресации, Форма.Запись.ДополнительныйОбъектАдресации);
	КонецЕсли;
	
	Форма.Элементы.ОтКого.СписокВыбора.ЗагрузитьЗначения(МассивИсполнителей);
	Форма.Элементы.Кому.СписокВыбора.ЗагрузитьЗначения(МассивИсполнителей);
	
	Если Форма.СпособПередачи = "ОтПользователяКПользователюВРамкахРоли" Тогда
		Если Форма.Элементы.ОтКого.СписокВыбора.НайтиПоЗначению(Форма.Запись.ОтКого) = Неопределено Тогда
			Форма.Запись.ОтКого = "";
		КонецЕсли;
		Если Форма.Элементы.Кому.СписокВыбора.НайтиПоЗначению(Форма.Запись.Кому) = Неопределено Тогда
			Форма.Запись.Кому = "";
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИсполнителиРоли(РольИсполнителей, ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсполнителиЗадач.Исполнитель КАК Исполнитель
	|ИЗ
	|	РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	|ГДЕ
	|	ИсполнителиЗадач.РольИсполнителя = &РольИсполнителя";
	
	Если ОсновнойОбъектАдресации <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст 
			+ "	И ИсполнителиЗадач.ОсновнойОбъектАдресации = &ОсновнойОбъектАдресации";
		Запрос.Параметры.Вставить("ОсновнойОбъектАдресации", ОсновнойОбъектАдресации);
	КонецЕсли;
	Если ДополнительныйОбъектАдресации <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст 
			+ "	И ИсполнителиЗадач.ДополнительныйОбъектАдресации = &ДополнительныйОбъектАдресации";
		Запрос.Параметры.Вставить("ДополнительныйОбъектАдресации", ДополнительныйОбъектАдресации);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("РольИсполнителя", РольИсполнителей);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Исполнитель");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеЭлементамиФормы(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "РольИсполнителей", "Видимость", Форма.СпособПередачи <> "ОтПользователяКПользователю");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "РольИсполнителей", "АвтоОтметкаНезаполненного", Форма.СпособПередачи <> "ОтПользователяКПользователю");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ОтКого", "АвтоОтметкаНезаполненного", Форма.СпособПередачи <> "ОтРолиКПользователю");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ОтКого", "Видимость", Форма.СпособПередачи <> "ОтРолиКПользователю");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ОтКого", "РежимВыбораИзСписка", Форма.СпособПередачи = "ОтПользователяКПользователюВРамкахРоли");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "Кому", "РежимВыбораИзСписка", Форма.СпособПередачи = "ОтПользователяКПользователюВРамкахРоли");
	
КонецПроцедуры

#КонецОбласти
